app/controllers/schedules_controller.rb

  def index
    @schedules = Schedule.all
---
SELECT "schedules".* FROM "schedules"

  def create
    @schedule = Schedule.new(params.require(:schedule).permit(:title, :start_at, :end_at, :all_day, :memo))
    if @schedule.save
---
INSERT INTO "schedules" ("title", "start", "end", "allday", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "練習"], ["start", "2023-04-10"], ["end", "2023-04-15"], ["allday", 1], ["memo", "練習予定作成"], ["created_at", "2023-04-10 12:57:20.357536"], ["updated_at", "2023-04-10 12:57:20.357536"]]

  def show
    @schedule = Schedule.find(params[:id])
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @schedule = Schedule.find(params[:id])
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @schedule = Schedule.find(params[:id])
    if @schedule.update(params.require(:schedule).permit(:title, :start_at, :end_at, :all_day, :memo))
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "schedules" SET "all_day" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["all_day", 1], ["updated_at", "2023-04-11 13:41:52.760890"], ["id", 1]]

  def destroy
    @schedule = Schedule.find(params[:id])
    @schedule.destroy
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 3]]